app/controllers/bookings_controller.rb

  def create
    @booking = Booking.new(booking_params)
    @booking.user = current_user
    @booking.room = Room.find(params[:room_id])

    if @booking.save
---
SELECT "users".* FROM "users" WHERE "users"."id" = $1 ORDER BY "users"."id" ASC LIMIT $2  [["id", 1], ["LIMIT", 1]]
SELECT "rooms".* FROM "rooms" WHERE "rooms"."id" = $1 LIMIT $2  [["id", 22], ["LIMIT", 1]]
INSERT INTO "bookings" ("starts_at", "ends_at", "user_id", "room_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["starts_at", "2022-06-24"], ["ends_at", "2022-06-30"], ["user_id", 1], ["room_id", 22], ["created_at", "2022-06-23 17:04:37.723225"], ["updated_at", "2022-06-23 17:04:37.723225"]]