app/controllers/pages_controller.rb

  def home
    @rooms = Room.where("capacity < 4").first(3)
---
SELECT "rooms".* FROM "rooms" WHERE (price_by_night > 150) ORDER BY "rooms"."id" ASC LIMIT $1  [["LIMIT", 3]]