app/controllers/rooms_controller.rb

  def show
    @booking = Booking.new
    @room = Room.find(params[:id])
    @bookings = @room.bookings
    @bookings_dates = @bookings.map do |booking|
---
SELECT "rooms".* FROM "rooms" WHERE "rooms"."id" = $1 LIMIT $2  [["id", 22], ["LIMIT", 1]]
SELECT "bookings".* FROM "bookings" WHERE "bookings"."room_id" = $1  [["room_id", 22]]